In [1]:
fruits = ["apple", "banana", "cherry"]
fruits.append("orange")

In [2]:
fruits

['apple', 'banana', 'cherry', 'orange']

In [5]:
fruits = ["apple", "banana", "cherry"]
fruits.insert(2,"lemon")

In [6]:
fruits

['apple', 'banana', 'lemon', 'cherry']

In [7]:
fruits = ("apple", "banana", "cherry", "orange", "kiwi", "melon", "mango")
print(fruits[
2:5
])

('cherry', 'orange', 'kiwi')

In [9]:
from datetime import date
date=date.today()
print(date)

2023-08-24

In [10]:
today=date.today()

In [11]:
today_2=date.today()

In [23]:
today_2

datetime.date(2023, 8, 24)

In [12]:
current_date=today.strftime("%y-%m-%d")

In [13]:
current_date_2=today_2.strftime("%y-%m-%d")

In [22]:
current_date_2

'23-08-24'

In [20]:
import time
today=time.localtime()
time=time.strftime("%H:%M:%S",today)
print(t)

13:48:24

In [40]:
lst1=[["Gowthami","Bcom","Economics"],["Durga","Bsc","Computers"],["Thabasum","Msc","Bio_Chemistry"],["Anusha","Msc","Maths"]]

In [39]:
import pandas as pd

In [41]:
df=pd.DataFrame(lst1,columns=["Name","Qualification","Subject"])

In [45]:
df

       Name Qualification        Subject
0  Gowthami          Bcom      Economics
1     Durga           Bsc      Computers
2  Thabasum           Msc  Bio_Chemistry
3    Anusha           Msc          Maths

In [46]:
df2=df[(df.Qualification=="Bcom") & (df.Subject=="Economics")]
df2

       Name Qualification    Subject
0  Gowthami          Bcom  Economics

In [47]:
df3=df[(df.Qualification=="Msc")&((df.Name=="Thabasum")|(df.Name=="Anusha"))]
df3

       Name Qualification        Subject
2  Thabasum           Msc  Bio_Chemistry
3    Anusha           Msc          Maths

In [50]:
df1 = df.loc[(df['Qualification']=="Bcom") & (df['Subject']=="Economics")]

In [51]:
df1

       Name Qualification    Subject
0  Gowthami          Bcom  Economics

In [49]:
df1 = df.loc[(df['Qualification']=="Msc") & (df['Subject']=="Bio_Chemistry")]
print(df1)

       Name Qualification        Subject
2  Thabasum           Msc  Bio_Chemistry

In [1]:
import pandas as pd
 
# Creating the DataFrame
df = pd.DataFrame({'Weight':[45, 88, 56, 15, 71],
                'Name':['Sam', 'Andrea', 'Alex', 'Robin', 'Kia'],
                'Age':[14, 25, 55, 8, 21]})

In [2]:
df

   Weight    Name  Age
0      45     Sam   14
1      88  Andrea   25
2      56    Alex   55
3      15   Robin    8
4      71     Kia   21

In [5]:
df.columns=["Weight_c","Name_d","Age_a"]
df

   Weight_c  Name_d  Age_a
0        45     Sam     14
1        88  Andrea     25
2        56    Alex     55
3        15   Robin      8
4        71     Kia     21

In [58]:
df1=df.loc[(df['Weight']>20)&(df['Age']>15)]

In [59]:
df1

   Weight    Name  Age
1      88  Andrea   25
2      56    Alex   55
4      71     Kia   21

In [33]:
result = df.loc[3, 'Age']
 
# Print the result
print(result)

8

In [34]:
result = df.loc[:, ['Weight', 'Name']]
 
# Print the result
print(result)

   Weight    Name
0      45     Sam
1      88  Andrea
2      56    Alex
3      15   Robin
4      71     Kia

In [37]:
# Import pandas library
import pandas as pd
  
# initialize list of lists
data = [['tom', 10], ['nick', 15], ['juli', 14]]
  
# Create the pandas DataFrame
df = pd.DataFrame(data, columns=['Name', 'Age'])
  
# print dataframe.
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

In [60]:
data = {'Name': ['Tom', 'nick', 'krish', 'jack'],
        'Age': [20, 21, 19, 18],"Gender":['M','M','M','M']}

In [62]:
print(data)

{'Name': ['Tom', 'nick', 'krish', 'jack'], 'Age': [20, 21, 19, 18], 'Gender': ['M', 'M', 'M', 'M']}

In [63]:
df=pd.DataFrame(data)

In [66]:
df

    Name  Age Gender
0    Tom   20      M
1   nick   21      M
2  krish   19      M
3   jack   18      M

In [67]:
print(df)

    Name  Age Gender
0    Tom   20      M
1   nick   21      M
2  krish   19      M
3   jack   18      M

In [70]:
# import module
import pandas as pd
 
# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                           
                          'Age': [30, 35, 37, 33, 34, 30],
                           
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                           
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})
# filter dataframe
display(dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D')),
                    ['Name','JOB']])

        Name       JOB
0   RACHEL    DESIGNER

In [74]:
df2=dataFrame.loc[(dataFrame['Salary']>=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('D'))]

In [75]:
df2

        Name  Age  Salary       JOB
0   RACHEL     30  100000  DESIGNER

In [78]:
# import module
import pandas as pd
import numpy as np
 
# assign data
dataFrame = pd.DataFrame({'Name': [' RACHEL  ', ' MONICA  ', ' PHOEBE  ',
                                   '  ROSS    ', 'CHANDLER', ' JOEY    '],
                           
                          'Age': [30, 35, 37, 33, 34, 30],
                           
                          'Salary': [100000, 93000, 88000, 120000, 94000, 95000],
                           
                          'JOB': ['DESIGNER', 'CHEF', 'MASUS', 'PALENTOLOGY',
                                  'IT', 'ARTIST']})
 
# filter dataframe                                  
filtered_values = np.where((dataFrame['Salary']<=100000) & (dataFrame['Age']< 40) & (dataFrame['JOB'].str.startswith('C')))
print(filtered_values)
display(dataFrame.loc[filtered_values])

(array([1], dtype=int64),)

        Name  Age  Salary   JOB
1   MONICA     35   93000  CHEF

In [2]:
import math
l=int(input('enter the length'))

enter the length5

In [8]:
b=int(input('enter the breadth'))
h=int(input('enter the height'))

enter the breadth6
enter the height7

In [11]:
a=2*(l*b+b*h+h*l)

In [12]:
print ('total surface of cuboid is',a)

total surface of cuboid is 214

In [13]:
b=2*(l+b)*h

In [14]:
print('the later area of cuboid is',b)

the later area of cuboid is 154

In [15]:
v=l*b*h
print('the volume of cuboid is',v)

the volume of cuboid is 5390

In [49]:
import math
r=float(input('enter the radius of the circle'))

enter the radius of the circle7

In [50]:
area=3.14*r*r
print('area of circle is',area)

area of circle is 153.86

In [51]:
c=2*3.14*r
print('circumference of circle is',c)

circumference of circle is 43.96

In [67]:
a=int(input('enter  first side of the scalene triangle'))

enter  first side of the scalene triangle6

In [68]:
b=int(input('enter  second side of the scalene triangle'))

enter  second side of the scalene triangle4

In [69]:
c=int(input('enter  third side of the scalene triangle'))

enter  third side of the scalene triangle5

In [70]:
s=a+b+c/2

In [73]:
area =(s*(s-a)*(s-b)*(s-c))

In [74]:
print("area of scalene triangle",area)

area of scalene triangle 5179.6875

In [6]:
a=input()

2

In [7]:
b=input()

3

In [9]:
result=a+b
print(a+b)

23

In [10]:
a=input()

2

In [11]:
print(type(a))

<class 'str'>

In [16]:
print(type(10))

<class 'int'>

In [18]:
a="5"
print(type(a))

<class 'str'>

In [20]:
a=int()
print(type(a))

<class 'int'>

In [12]:
import pandas as pd
import numpy as np

In [13]:
NDC_DCR_LIST=pd.read_excel(r"C:\Users\hp\Downloads\InputFiles.xlsx",sheet_name="NDC_DCR_LIST")

In [14]:
NDC_DCR_LIST

      NDC_NBR  DCR_DRUG_LST_ID
0       10001                1
1       10001                2
2       10001                3
3       10001                4
4       10001                5
...       ...              ...
1014    10062                6
1015    10062                7
1016    10062                8
1017    10062                9
1018    10062               10

[1019 rows x 2 columns]

In [15]:
print(type(NDC_DCR_LIST))

<class 'pandas.core.frame.DataFrame'>

In [1]:
a=input()

2

In [18]:
#a=int(a)

In [2]:
b=input()

3

In [19]:
#b=int(b)

In [3]:
result=a+b

In [11]:
print("n:",""+str(result))

n: 23

In [6]:
a=input()

5

In [10]:
a=int(a)

In [7]:
b=input()

3

In [11]:
b=int(b)

In [12]:
c=a+b

In [14]:
print("sum:"+str(c))

sum:8

In [16]:
first_string='apple'

In [17]:
second_string='application'

In [18]:
first_string_part=first_string[0:3]

In [19]:
second_string_part=second_string[0:3]

In [21]:
result=(first_string_part==second_string_part)

In [22]:
print(result)

True

In [14]:
lst=["a","b","c","d","e","f","g"]
for i in lst:
    print(i)

a
b
c
d
e
f
g

In [20]:
lst=["a","b","c","d","e","f","g"]
for i in lst:
    print(i)
var="var"+i

a
b
c
d
e
f
g